In [1]:
# Pandas.DataFrame.loc[] Syntax & Usage
import pandas as pd
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas"],
    'Fee' :[20000,25000,26000,22000,24000],
    'Duration':['30day','40days','35days','40days','60days'],
    'Discount':[1000,2300,1200,2500,2000]
              }
index_labels=['r1','r2','r3','r4','r5']
df = pd.DataFrame(technologies,index=index_labels)
print(df)

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500
r5   pandas  24000   60days      2000

In [2]:
# Select Single Row by Label
print(df.loc['r2'])

Courses     PySpark
Fee           25000
Duration     40days
Discount       2300
Name: r2, dtype: object

In [3]:
# Select Single Column by label
print(df.loc[:, "Courses"])

r1      Spark
r2    PySpark
r3     Hadoop
r4     Python
r5     pandas
Name: Courses, dtype: object

In [4]:
# Select Multiple Rows by Label
print(df.loc[['r2','r3']])

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200

In [5]:

# Select Rows Between two Index Labels
# Includes both r1 and r4 rows
print(df.loc['r1':'r4'])

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500

In [6]:
# Select Columns between two Labels
# Include both 'Fee' and 'Discount' columns
print(df.loc[:,'Fee':'Discount'])

      Fee Duration  Discount
r1  20000    30day      1000
r2  25000   40days      2300
r3  26000   35days      1200
r4  22000   40days      2500
r5  24000   60days      2000

In [7]:

# Select Alternate rows By indeces
print(df.loc['r1':'r4':2])

   Courses    Fee Duration  Discount
r1   Spark  20000    30day      1000
r3  Hadoop  26000   35days      1200

In [8]:
# Using Conditions
print(df.loc[df['Fee'] >= 24000])

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r5   pandas  24000   60days      2000

### pandas.DataFrame.iloc[] Syntax & Usage

In [9]:
import pandas as pd
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas"],
    'Fee' :[20000,25000,26000,22000,24000],
    'Duration':['30day','40days','35days','40days','60days'],
    'Discount':[1000,2300,1200,2500,2000]
              }
index_labels=['r1','r2','r3','r4','r5']
df = pd.DataFrame(technologies,index=index_labels)
print(df)

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500
r5   pandas  24000   60days      2000

In [10]:
# Select Single Row by Index
print(df.iloc[1])

Courses     PySpark
Fee           25000
Duration     40days
Discount       2300
Name: r2, dtype: object

In [11]:
# Select Multiple Rows by Index
print(df.iloc[[1,2]])

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200

In [12]:
# Select Multiple Columns by Index
print(df.iloc[:, [0,1,3]])

    Courses    Fee  Discount
r1    Spark  20000      1000
r2  PySpark  25000      2300
r3   Hadoop  26000      1200
r4   Python  22000      2500
r5   pandas  24000      2000

In [13]:
# Select Rows Between two Indexs
# Includes Index 0 & Execludes 4
print(df.iloc[0:4])

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500

In [14]:
# Select Alternate rows By Index
print(df.iloc[0:4:2])

   Courses    Fee Duration  Discount
r1   Spark  20000    30day      1000
r3  Hadoop  26000   35days      1200

In [15]:

# By Condition
print(df.iloc[list(df['Fee'] >= 24000)])

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r5   pandas  24000   60days      2000

### filter() Syntax

In [2]:
# Create DataFrame
import pandas as pd
technologies= {
    'Courses':["Spark","PySpark","Spark","Java","PySpark","PHP"],
    'Fee' :[22000,25000,23000,24000,26000,27000],
    'Duration':['30days','50days','30days','60days','35days','30days']
          }
df = pd.DataFrame(technologies)
print(df)

   Courses    Fee Duration
0    Spark  22000   30days
1  PySpark  25000   50days
2    Spark  23000   30days
3     Java  24000   60days
4  PySpark  26000   35days
5      PHP  27000   30days

In [17]:
# Filter columns
df2=df.filter(items=['Courses','Fee'])
print(df2)

   Courses    Fee
0    Spark  22000
1  PySpark  25000
2    Spark  23000
3     Java  24000
4  PySpark  26000
5      PHP  27000

In [18]:
# Filter Columns using like param
df2 = df.filter(like='ration', axis=1)
print(df2)

  Duration
0   30days
1   50days
2   30days
3   60days
4   35days
5   30days

In [22]:
# Filr column names by regex
df2 = df.filter(regex='s$', axis=1)
print(df2)

   Courses
0    Spark
1  PySpark
2    Spark
3     Java
4  PySpark
5      PHP

In [20]:
# Filter rows by index
df2=df.filter(items=[3,5], axis=0)
print(df2)

  Courses    Fee Duration
3    Java  24000   60days
5     PHP  27000   30days

In [21]:
# Filter row using like
df2 = df.filter(like='4', axis=0)
print(df2)

   Courses    Fee Duration
4  PySpark  26000   35days

In [23]:
# Filter rows by index
df2=df.filter(items=[3,5], axis=0)
print(df2)

  Courses    Fee Duration
3    Java  24000   60days
5     PHP  27000   30days

In [24]:

# Create DataFrame
import pandas as pd
import numpy as np
technologies= {
    'Courses':["Spark","PySpark","Spark","Python","PySpark"],
    'Fee' :[22000,25000,23000,24000,26000],
    'Discount':[1500,1000,1200,800,1300],
    'Duration':['30days','50days','30days','35days','40days']
          }
df = pd.DataFrame(technologies)
print(df)

   Courses    Fee  Discount Duration
0    Spark  22000      1500   30days
1  PySpark  25000      1000   50days
2    Spark  23000      1200   30days
3   Python  24000       800   35days
4  PySpark  26000      1300   40days

In [25]:

# Default example
df2=df.where(df.Fee > 23000)
print(df2)

   Courses      Fee  Discount Duration
0      NaN      NaN       NaN      NaN
1  PySpark  25000.0    1000.0   50days
2      NaN      NaN       NaN      NaN
3   Python  24000.0     800.0   35days
4  PySpark  26000.0    1300.0   40days

In [26]:
# Use other param
df2=df.where(df.Fee > 23000,'NA')
print(df2)

   Courses    Fee Discount Duration
0       NA     NA       NA       NA
1  PySpark  25000     1000   50days
2       NA     NA       NA       NA
3   Python  24000      800   35days
4  PySpark  26000     1300   40days

# Updating on existing DataFrame
df.where(cond1 & cond2, 'NA', inplace=True) 
print(df)

In [5]:

# Create a pandas DataFrame.
import pandas as pd
import numpy as np
technologies= {
    'Fee' :[22000,25000,23000,np.NaN,26000],
    'Duration':['30days','50days','30days','35days','40days']
          }
df = pd.DataFrame(technologies)
print("Create DataFrame:\n", df)

Create DataFrame:
        Fee Duration
0  22000.0   30days
1  25000.0   50days
2  23000.0   30days
3      NaN   35days
4  26000.0   40days

In [6]:
# Using Lambda Function
df['Fee'] = df['Fee'].map(lambda x: x - (x*10/100))
print("After applying map to specific column:\n", df)

After applying map to specific column:
        Fee Duration
0  19800.0   30days
1  22500.0   50days
2  20700.0   30days
3      NaN   35days
4  23400.0   40days

In [7]:
# Create a pandas DataFrame.
import pandas as pd
import numpy as np
technologies = {
    'Courses':["Spark","PySpark","Spark","Python","PySpark"],
    'Fee' :[22000,25000,23000,24000,26000],
    'Duration':['30days','50days','30days','35days','NaN']
          }
df = pd.DataFrame(technologies)
print("Create DataFrame:\n", df)

Create DataFrame:
    Courses    Fee Duration
0    Spark  22000   30days
1  PySpark  25000   50days
2    Spark  23000   30days
3   Python  24000   35days
4  PySpark  26000      NaN

In [8]:
# Replace column value
df2 = df.replace('Spark','Apache Spark')
print("After replacing a value with another value:\n", df2)

After replacing a value with another value:
         Courses    Fee Duration
0  Apache Spark  22000   30days
1       PySpark  25000   50days
2  Apache Spark  23000   30days
3        Python  24000   35days
4       PySpark  26000      NaN

In [9]:
# Create DataFrame
import pandas as pd
import numpy as np
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas",np.nan],
    'Fee' :[20000,25000,26000,23093,24000,np.nan],
    'Duration':['30day','40days','35days','45days',np.nan,np.nan],
    'Discount':[1000,np.nan,1200,2500,pd.NaT,np.nan],
    '':[np.nan,np.nan,np.nan,np.nan,np.nan,np.nan]
              }
index_labels=['r1','r2','r3','r4','r5','']
df = pd.DataFrame(technologies,index=index_labels)
print(df)

    Courses      Fee Duration Discount
r1    Spark  20000.0    30day     1000 NaN
r2  PySpark  25000.0   40days      NaN NaN
r3   Hadoop  26000.0   35days     1200 NaN
r4   Python  23093.0   45days     2500 NaN
r5   pandas  24000.0      NaN      NaT NaN
        NaN      NaN      NaN      NaN NaN

In [10]:
# Drop rows that has all Nan Values
df = df.dropna(how='all')
print(df)

    Courses      Fee Duration Discount
r1    Spark  20000.0    30day     1000 NaN
r2  PySpark  25000.0   40days      NaN NaN
r3   Hadoop  26000.0   35days     1200 NaN
r4   Python  23093.0   45days     2500 NaN
r5   pandas  24000.0      NaN      NaT NaN

In [11]:

# Drop columns that has all Nan Values
df = df.dropna(how='all',axis=1)
print(df)

    Courses      Fee Duration Discount
r1    Spark  20000.0    30day     1000
r2  PySpark  25000.0   40days      NaN
r3   Hadoop  26000.0   35days     1200
r4   Python  23093.0   45days     2500
r5   pandas  24000.0      NaN      NaT

In [12]:
# Drop rows that contains nan values
df2=df.dropna()
print(df2)

   Courses      Fee Duration Discount
r1   Spark  20000.0    30day     1000
r3  Hadoop  26000.0   35days     1200
r4  Python  23093.0   45days     2500

In [13]:
# Drop rows that has NaN values on selected columns
df2=df.dropna(subset=['Courses','Duration'])
print(df2)

    Courses      Fee Duration Discount
r1    Spark  20000.0    30day     1000
r2  PySpark  25000.0   40days      NaN
r3   Hadoop  26000.0   35days     1200
r4   Python  23093.0   45days     2500

In [17]:
df2

    Courses      Fee Duration Discount
r1    Spark  20000.0    30day     1000
r2  PySpark  25000.0   40days      NaN
r3   Hadoop  26000.0   35days     1200
r4   Python  23093.0   45days     2500
r5   pandas  24000.0      NaN      NaT

In [18]:
# With threshold, 
# Keep only the rows with at least 2 non-NA values.
df2=df.dropna(thresh=3)

In [19]:
df2

    Courses      Fee Duration Discount
r1    Spark  20000.0    30day     1000
r2  PySpark  25000.0   40days      NaN
r3   Hadoop  26000.0   35days     1200
r4   Python  23093.0   45days     2500

In [27]:
df2.head(-3) #Use negative numbers for N to get the rows except for N rows from the last.

   Courses      Fee Duration Discount
r1   Spark  20000.0    30day     1000